import cv2
# 读取../img/4.1.jpg
# 表示坐标(291, 218)上的像素的BGR值
img = cv2.imread('../imgs/4.1.jpg')
px = img[291, 218]
print("坐标(291, 218)上的像素的BGR值是", px)
# 单独读取每个通道的值
blue = img[291, 218, 0]  # 坐标(291, 218)上的像素的B通道的值
green = img[291, 218, 1]  # 坐标(291, 218)上的像素的G通道的值
red = img[291, 218, 2]  # 坐标(291, 218)上的像素的R通道的值
print(blue, green, red)

# 现要将像素px的BGR值由原来的(36, 42, 49)修改为(255, 255, 255)
px = [255, 255, 255]
print("坐标(291, 218)上像素修改后的BGR值是", px)

# 编写一个程序，将图中的坐标(241, 168)、(241, 218)、(291, 168)和(291, 218)
# 4个点所围成的区域内的所有像素都修改为纯白色
img1 = cv2.imread('../imgs/4.1.jpg')
cv2.imshow('4.1', img1)  # 显示图4.1
for x in range(241, 292):  # x表示横坐标，在241,291之间取值
    for y in range(168, 219):  # y表示纵坐标，在168,218之间取值
        img1[x, y] = [255, 255, 255]  # 将区域内所有像素修改为白色
cv2.imshow('4.8', img1)  # 显示修改后图片4.8
cv2.waitKey()
cv2.destroyAllWindows()
